{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.6", "config": [{"class_name": "Embedding", "config": {"embeddings_regularizer": null, "dtype": "float32", "input_dim": 500, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "batch_input_shape": [null, 30], "output_dim": 8, "activity_regularizer": null, "mask_zero": false, "input_length": 30, "name": "embedding_20", "trainable": true, "embeddings_constraint": null}}, {"class_name": "Flatten", "config": {"name": "flatten_12", "trainable": true}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "units": 1, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "name": "dense_19", "activation": "sigmoid", "activity_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_constraint": null}}]}